{
  "items": [
    {
      "id": "diffusion",
      "title": "Diffusion",
      "short_desc": "I used diffusion models to generate drug-like molecules that bind to the Y220C mutant of p53, and I presented this work at the ACS Nerd Conference and the Wesleyan Biophysics Retreat.",
      "long_desc": "This poster focuses on using diffusion models for structure-conditioned molecular generation. The project combines SE(3)-equivariant networks, pocket-aware conditioning, and guided sampling to steer the generative process toward molecules predicted to bind the Y220C variant of p53. It highlights how diffusion architectures can integrate spatial protein features, optimize chemical properties during sampling, and outperform traditional RL-based tuning approaches for targeted drug-design tasks.",
      "image_full": "img/projects/poster-10-29-25-jeremy-zay-full.png",
      "image_thumb": "img/projects/poster-10-29-25-jeremy-zay-thumb.png",
      "image_alt": "Diffusion",
      "sort_order": 0,
      "is_published": true
    },
    {
      "id": "reinforcement-learning",
      "title": "Reinforcement Learning",
      "short_desc": "I used reinforcement learning fine-tuning to generate molecules that bind to mutant p53, and presented my poster at the UC Merced Mercury Conference and Wesleyan Biophysics Retreat.",
      "long_desc": "This poster presents a reinforcement-learning framework for generating small molecules guided by molecular dynamics simulations of the p53 Y220C mutant. The workflow combines MD-derived structural insights, docking-based reward functions, and an actor-critic RL model to steer generation toward allosteric effectors with favorable binding profiles. By integrating simulation data with RL-driven optimization, the project explores how feedback from protein conformational behavior can shape molecular design policies and improve targeted allosteric reactivation strategies.",
      "image_full": "img/projects/poster-full.jpg",
      "image_thumb": "img/projects/poster-thumb.jpg",
      "image_alt": "Molecular Dynamics Simulations of p53 Poster",
      "sort_order": 1,
      "is_published": true
    },
    {
      "id": "asteroids",
      "title": "Asteroids",
      "short_desc": "I recreated the 1980s arcade game Asteroids from scratch using PyGame in Python. Do you think you can beat my high score?",
      "long_desc": "My dad grew up playing this game on arcade machines in a bowling alley, so I decided to recreate it for him in Python. Try to beat my high score!",
      "image_full": "img/projects/asteroids-full.png",
      "image_thumb": "img/projects/asteroids-full.png",
      "image_alt": "Asteroids",
      "sort_order": 2,
      "is_published": true
    },
    {
      "id": "zaychess",
      "title": "Zaychess",
      "short_desc": "I created a <a href='/zaychess' style='display: inline;'>java Chess app</a> integrated with a powerful AI engine. You can try to beat the AI, but you won't succeed.",
      "long_desc": "Click here to download on the MacOS app store, or download the Zaychess .jar or the .app (for MacOS) right <a href='/zaychess'>here</a>.",
      "image_full": "img/projects/zaychess-full.png",
      "image_thumb": "img/projects/zaychess-thumb.png",
      "image_alt": "Zaychess",
      "sort_order": 3,
      "is_published": true
    }
  ]
}